class DoyaController {
  final dailyDua = [
    {
      'title': 'মসজিদে প্রবেশ করিবার দোয়া',
      'about':
          'মানুষ নামাজ আদায়ের উদ্দেশ্যে মসজিদে প্রবেশ করে। মসজিদে প্রবেশ করার সময় পড়ার জন্য রাসূল আকরাম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে যেই দোয়াটি সাব্যস্ত আছে তা হলো: ',
      'bangla': 'উচ্চারণ : আল্লাহুম্মাফ তাহলি আবওয়াবা রাহমাতিকা',
      'arabic': 'আরবি : اللهم افتح لى ابواب رحمتك ',
      'question': 'মসজিদে প্রবেশের পর প্রথম কাজ কী?',
      'description':
          '''                           মসজিদ আল্লাহর ঘর। মুমিন মুসলমানের ইবাদতের স্থান। আল্লাহর ইবাদত-বন্দেগির জন্যই মানুষ মসজিদে প্রবেশ করে। কিন্তু মসজিদে প্রবেশ করেই কি বিশেষ কোনো কাজ আছে? এ সম্পর্কে হাদিসের নির্দেশনাই বা কী?

রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম মসজিদে প্রবেশ করার পর দুই রাকাআত নামাজ পড়ার জন্য তাগিদ দিয়েছেন। বসার আগেই নামাজ পড়ার দিকনির্দেশনা এসেছে হাদিসে-
হজরত জাবির ইবনে আবদুল্লাহ রাদিয়াল্লাহু আনহু বর্ণনা করেন (কোনো এক) জুমআর দিন রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম লোকদের সামনে খুতবাহ দিচ্ছিলেন। এমন সময় এক ব্যক্তি (মসজিদে) এলে তিনি তাকে জিজ্ঞাসা করলেন, ‘ওহে! তুমি কি নামাজ আদায় করেছ? সে বলল, ‘না’। রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বললেন, ‘উঠ, নামাজ আদায় করে নাও।’ (বুখারি)

মসজিদে প্রবেশ করেই দুই রাকাআত নামাজ আদায় করা প্রিয় নবি সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের সুন্নাত। মসজিদে ঢুকে দুই রাকাআত নামাজ পড়া ছাড়া বসতে নিষেধ করেছেন প্রিয় নবি। হাদিসের অন্য বর্ণনায় তা সুস্পষ্টভাবে ওঠে এসেছে-

- হজরত আবু কাতাদাহ রাদিয়াল্লাহু আনহু বর্ণনা করেন রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন, ‘তোমাদের মধ্যে কেউ মসজিদে প্রবেশ করে যতক্ষণ পর্যন্ত সে দুই রাকাআত নামাজ না পড়ে; ততক্ষন পর্যন্ত যেন না বসে।’ (বুখারি)

- হজরত আবু কাতাদাহ রাদিয়াল্লাহু আনহু থেকে আরও বর্ণিত, নিশ্চয়ই রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন, ‘তোমাদের মধ্যে কেউ মসজিদে প্রবেশ করে, সে যেন বসার আগে দুই রাকাআত নামাজ পড়ে।’ (বুখারি, মিশকাত)

- হজরত আবু কাতাদা রাদিয়াল্লাহু আনহু বর্ণনা করেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন, যখন তোমাদের কেউ মসজিদে প্রবেশ করে, তখন বসার আগে দুই রাকাআত নামাজ আদায় করবে।’ (মুসলিম)''',
      'meaning':
          'অর্থ: হে আল্লাহ আপনার রহমতের দরজাসমূহ আমার জন্য খুলে দিন। (মুসলিম, নাসায়ী)।',
    },
    {
      'title': 'মসজিদ হইত বাহির হইবার দোয়া',
      'bangla': 'বাংলায় : (আল্লা-হুম্মা ইন্নি আছআলুকা-মিন ফাদলিকা।',
      'arabic': 'বাংলায় : (আল্লা-হুম্মা ইন্নি আছআলুকা-মিন ফাদলিকা।',
      'description': 'Text here to find more2',
      'meaning':
          'অর্থ: হে আল্লাহ আপনার রহমতের দরজাসমূহ আমার জন্য খুলে দিন। (মুসলিম, নাসায়ী)।',
    },
    // {
    //   'title': 'স্ত্রী সহবাসের দোয়া',
    //   'bangla':
    //       'বাংলায়: (বিছমিল্লা-হি আল্লা-হুম্মা জান্নিব-নাশ শাইত্বানা ওয়া জান্নিবিশ শাইত্বানা মা রাজাকতানা। )',
    // },
    {
      'title': 'ঘুম হইতে জাগিবা মাত্রই পড়িবে',
      'bangla':
          'বাংলায়: (আলহামদু লিল্লা-হিল্লাজী আহ্ইয়ানা বা’দা মা আমা তানা ওয়া-ইলাইহিন্নশুর।',
      'description': 'Text here to find more3'
    },
    {
      'title': 'পায়খানার প্রবেশ করিবার আগে এই দোয়া পড়িবেন',
      'bangla':
          'বাংলায়: (আল্লাহুম্মা ইন্নী আউযুবিকা মিনাল খুবুছে অ-ল্ খাবায়েছে।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'অজু বিছমিল্লাহ বলিয়া শুরু করিয়া ভিতরে এই দোয়া পড়িবেন',
      'bangla':
          'বাংলায়: (আল্লাহুম্মাগাফিরলী যানবী অ-অ চ্ছেয়্, লী ফী দীরা অবা-রেকলী ফী রিজক্কী।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'অজু শেষ করিয়া কালেমা শাহাদাতের পর এই দোয়া পড়িবে',
      'bangla':
          'বাংলায়: (আল্লাহুম্মাজ আল্নী মিনাততাওয়া-বীনা অজ আল্নী মিনাল মোতাত্বহেরীন।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'মেছওয়াক/ দাঁত পরিস্কারের দোয়া',
      'bangla': 'বাংলায়: আল্লাহুম্মা বা- রিক্লী ফীহে।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'কাপড় পরিধানের দোয়া',
      'bangla':
          'বাংলায়: (আল্হামদু লিল্লাহিল্লাজী কাছানী মা উয়ারী বিহী আওরাতী অ আতাজাম্মাল্লু বিহী ফী হায়া-তী)',
      'description': 'Text here to find more'
    },
    {
      'title': 'খাবার শুরু করার দোয়া',
      'bangla': 'বাংলায়: (বিসমিল্লাহে অ-আলা বারকাতিল্লাহে। )',
      'description': 'Text here to find more'
    },
    {
      'title': 'খাবার শেষ করার দোয়া',
      'bangla':
          'বাংলায়: আলহামদু-লিল্লা হিল্লাজী আত্ব আমানা অ- ছাক্কানা অ-জা আলানা মিনাল মুছলেমীন। )',
      'description': 'Text here to find more'
    },
    {
      'title': 'দাওয়াত বা অন্যের ঘরে খাওয়ার পর দোয়া',
      'bangla':
          'বাংলায়: (আল্লাহুম্মা আত্বয়েম মান আত্বআমানী ওয়াছ্ক্কে মান ছাক্কানী।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'ঘর হইতে বাহির হওয়ার দোয়া',
      'bangla': 'বাংলায়: (বিছমিল্লাহে তাওয়াক কালতু আলাল্লাহে।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'যানবাহনে আরোহনের দোয়া',
      'bangla':
          'বাংলায়:(আল্হামদু লিল্লাহে ছোবহা-নাল্লাজী ছাখ্খারা লানা হা-জা অমা কুন্না- লাহু মোক্করেনীন অ ইন্না ইলা রাব্বিনা লামোন -ক্কালেবুনা।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'ঘরে প্রবেশ করিতে সকলকে সালাম করিবে এবং নিচের দোয়া পড়িবে',
      'bangla':
          'বাংলায়: (আল্লাহুম্মা ইন্নী আছ্ -আলুকা মাওলেজে অ খাইরাল মাখরাজে।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'যে কোন কাজ শুরু করিতে পড়তে হবে',
      'bangla': 'বাংলায়:(বিসমিল্লাহির রাহ্মানির রাহীম।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'কাহাকেও বিদায় দিতে দোয়া',
      'bangla':
          'বাংলায়: (আছতাও দেউল্লা-হা দ্বীনাকা অ আমা-নাতাকা অ- খাওয়া – তীমা আমালিকা।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'ঘুমানোর দোয়া',
      'bangla': 'বাংলায়: (আল্লাহ্ম্মুা বিছ্মিকা আমূতু অ-আহ্ইয়া।)',
      'description': 'Text here to find more'
    },
  ];
}
