class DoyaController {
  final dailyDua = [
    {
      'title': 'মসজিদে প্রবেশ করিবার দোয়াঃ',
      'dua': 'বাংলায়: (আল্লা-হুম্মাফ তাহ্লী আবওয়াবা রাহ্মাতিকা।',
      'description': 'Text here to find more1'
    },
    {
      'title': 'মসজিদ হইত বাহির হইবার দোয়াঃ',
      'dua': 'বাংলায়: (আল্লা-হুম্মা ইন্নি আছআলুকা-মিন ফাদলিকা।',
      'description': 'Text here to find more2'
    },
    {
      'title': 'স্ত্রী সহবাসের দোয়াঃ',
      'dua':
          'বাংলায়: (বিছমিল্লা-হি আল্লা-হুম্মা জান্নিব-নাশ শাইত্বানা ওয়া জান্নিবিশ শাইত্বানা মা রাজাকতানা। )',
    },
    {
      'title': 'ঘুম হইতে জাগিবা মাত্রই পড়িবে:',
      'dua':
          'বাংলায়: (আলহামদু লিল্লা-হিল্লাজী আহ্ইয়ানা বা’দা মা আমা তানা ওয়া-ইলাইহিন্নশুর।',
      'description': 'Text here to find more3'
    },
    {
      'title': 'পায়খানার প্রবেশ করিবার আগে এই দোয়া পড়িবেন:',
      'dua': 'বাংলায়: (আল্লাহুম্মা ইন্নী আউযুবিকা মিনাল খুবুছে অ-ল্ খাবায়েছে।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'অজু বিছমিল্লাহ বলিয়া শুরু করিয়া ভিতরে এই দোয়া পড়িবেন:',
      'dua':
          'বাংলায়: (আল্লাহুম্মাগাফিরলী যানবী অ-অ চ্ছেয়্, লী ফী দীরা অবা-রেকলী ফী রিজক্কী।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'অজু শেষ করিয়া কালেমা শাহাদাতের পর এই দোয়া পড়িবে:',
      'dua':
          'বাংলায়: (আল্লাহুম্মাজ আল্নী মিনাততাওয়া-বীনা অজ আল্নী মিনাল মোতাত্বহেরীন।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'মেছওয়াক/ দাঁত পরিস্কারের দোয়া:',
      'dua': 'বাংলায়: আল্লাহুম্মা বা- রিক্লী ফীহে।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'কাপড় পরিধানের দোয়া:',
      'dua':
          'বাংলায়: (আল্হামদু লিল্লাহিল্লাজী কাছানী মা উয়ারী বিহী আওরাতী অ আতাজাম্মাল্লু বিহী ফী হায়া-তী)',
      'description': 'Text here to find more'
    },
    {
      'title': 'খাবার শুরু করার দোয়া:',
      'dua': 'বাংলায়: (বিসমিল্লাহে অ-আলা বারকাতিল্লাহে। )',
      'description': 'Text here to find more'
    },
    {
      'title': 'খাবার শেষ করার দোয়া:',
      'dua':
          'বাংলায়: আলহামদু-লিল্লা হিল্লাজী আত্ব আমানা অ- ছাক্কানা অ-জা আলানা মিনাল মুছলেমীন। )',
      'description': 'Text here to find more'
    },
    {
      'title': 'দাওয়াত বা অন্যের ঘরে খাওয়ার পর দোয়া:',
      'dua':
          'বাংলায়: (আল্লাহুম্মা আত্বয়েম মান আত্বআমানী ওয়াছ্ক্কে মান ছাক্কানী।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'ঘর হইতে বাহির হওয়ার দোয়া:',
      'dua': 'বাংলায়: (বিছমিল্লাহে তাওয়াক কালতু আলাল্লাহে।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'যানবাহনে আরোহনের দোয়া:',
      'dua':
          'বাংলায়:(আল্হামদু লিল্লাহে ছোবহা-নাল্লাজী ছাখ্খারা লানা হা-জা অমা কুন্না- লাহু মোক্করেনীন অ ইন্না ইলা রাব্বিনা লামোন -ক্কালেবুনা।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'ঘরে প্রবেশ করিতে সকলকে সালাম করিবে এবং নিচের দোয়া পড়িবে:',
      'dua': 'বাংলায়: (আল্লাহুম্মা ইন্নী আছ্ -আলুকা মাওলেজে অ খাইরাল মাখরাজে।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'যে কোন কাজ শুরু করিতে পড়তে হবে:',
      'dua': 'বাংলায়:(বিসমিল্লাহির রাহ্মানির রাহীম।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'কাহাকেও বিদায় দিতে দোয়া:',
      'dua':
          'বাংলায়: (আছতাও দেউল্লা-হা দ্বীনাকা অ আমা-নাতাকা অ- খাওয়া – তীমা আমালিকা।)',
      'description': 'Text here to find more'
    },
    {
      'title': 'ঘুমানোর দোয়া।',
      'dua': 'বাংলায়: (আল্লাহ্ম্মুা বিছ্মিকা আমূতু অ-আহ্ইয়া।)',
      'description': 'Text here to find more'
    },
  ];
}
